# Manipulating DataFrames

In [20]:
import pandas as pd
data = {
    'first': ['Carl', 'Francies', 'Sam'],
    'last': ['Po', 'Nyguen', 'Smith'],
    'age': ['32', '45', '22']
}

clients = pd.DataFrame(data)
clients

      first    last age
0      Carl      Po  32
1  Francies  Nyguen  45
2       Sam   Smith  22

# Renaming

In [21]:
clients.rename(columns={'first': 'First Name'})

  First Name    last age
0       Carl      Po  32
1   Francies  Nyguen  45
2        Sam   Smith  22

In [22]:
clients = clients.rename(index={0: 'a', 1:'b', 2:'c'})
clients

      first    last age
a      Carl      Po  32
b  Francies  Nyguen  45
c       Sam   Smith  22

In [23]:
clients.reset_index(inplace=True)
clients

  index     first    last age
0     a      Carl      Po  32
1     b  Francies  Nyguen  45
2     c       Sam   Smith  22

# Dropping

In [25]:
clients.drop(columns='first', inplace=True)
clients

  index    last age
0     a      Po  32
1     b  Nyguen  45
2     c   Smith  22

In [26]:
clients.drop(index=0)

  index    last age
1     b  Nyguen  45
2     c   Smith  22

# Set Type

In [27]:
clients.age

0    32
1    45
2    22
Name: age, dtype: object

In [28]:
clients.age.astype(int)

0    32
1    45
2    22
Name: age, dtype: int32